[
  {
    "template_name": "SOW Template 2023.docx",
    "content": "Proposal Date: Jun 7, 2021\nDocument Title\nsow/design\nVersion 1\n[customer logo]\nSolution Provided By\nDavid Gidony, Solution Architect\nTeraSky\ndavidg@terasky.com\n+972 52-280-8442\nTeraSky Ltd.\nTable of Contents\nAbout TeraSky Group\nTeraSky Group is a world leader in digital innovation solutions that drive the cloud and digital transformations that are essential for all today’s businesses – from the smallest companies to the largest global enterprises. TeraSky Group comprises multiple companies, each providing high-level professional services and architectural solutions focused on their unique areas of expertise and experience. By leveraging our highly experienced engineering teams, we help our customers by assessing, designing, providing a Proof of Concept (POC), implementing, selling and supporting a wide range of large-scale new information technology solutions. These solutions overcome critical business and technology challenges, as well as enable our customers to innovate in preparation for the future.\nTeraSky Modern IT specializes in designing, integrating, implementing, and supporting modern IT infrastructure solutions. Its technology solution offerings are based on vast experience and an unparalleled professional reputation in the following areas –\nTeraSky Cloud & DevOps specializes in designing, implementing, and supporting a wide range of cloud platforms and CI/CD automated pipelines. Its reputation is based on having successfully delivered cloud services that require comprehensive knowledge of the inner workings and interactions between applications, infrastructure, automation, processes, and people. TeraSky Cloud & DevOps technology offerings cover the following areas –\nTeraSky Artificial Intelligence (AI) helps organizations build optimized AI infrastructures by combining best-of-breed computing, storage, networking, and other types of required hardware. We ensure compatibility between this high-performance hardware and the software solutions in order to best take advantage of these unique devices. Our experts help our customers achieve an optimal AI infrastructure for their needs by training and inference. Our technology offering is based on extensive experience and on an outstanding professional reputation in the following areas –\nArtificial Intelligence (AI) Infrastructure\nMachine Learning (ML)\nDeep Learning (DL)\nGraphics Processing Units (GPUs)\nProfessional Services\nOur team has proven experience in advanced AI infrastructures that may contain multiple training machines connected via sophisticated networking that feed off state-of the-art storage systems – both on-premises and in the cloud. Our successes have positioned TeraSky as the leading AI solutions integrator that it is today.\nTeraSky End User Computing (EUC) specializes in achieving the ultimate user experience, in synergy with our customer’s IT and security requirements. TeraSky experts deliver a wide range of professional services using the leading IT workspace management solutions on the market and our company’s proprietary methodology. The high impact that End User Computing solutions have on an organization drives our commitment to providing the highest quality professional services. TeraSky improves the user experience during the transformation journey to the digital workspace, thus closing the ever-expanding gap between modern users’ digital workspace requirements and legacy IT workspaces.\nSky-TQ is a joint venture of TeraSky and ITQ and an important member of TeraSky Group. Both are global award winners for outstanding technology and professional service capabilities. ITQ is a Dutch company that has an internationally recognized professional services reputation for VMware technology-based solutions. Sky-TQ provides worldwide 24x7 technical support services from our European facilities that help our global customers meet all the critical criteria required by their business’s SLAs.\nTeraSky Group management invests significant resources to ensure that our team of experts has the most advanced training in the latest technologies. Our professional service teams are recognized as one of the best in the industry. Among other reasons, this is because they have acquired all the necessarily highest-level certifications and expert-level competencies from our global industry partners.\nIntroduction\nChubb is in the process of establishing a new service, which will allow their business units to consume Kubernetes as a service from IT in a self service manner.\nIn order to achieve this goal, Chubb has chosen VMware vCloud Foundation which will take advantage of the VMware SDDC building blocks to form this service into an operational, production ready cloud infrastructure for all agile teams within Chubb.\nThe purpose of this document is to elaborate, based on high level design,  the scope of work required to complete the implementation of VCF which will address Chubb business requirements.\nHigh Level Solution Diagram\n[Diagram]\nDescribe your solution in words\nBla bla\nBla bla\nSolution Components\nDescribe the solution components in words / diagrams. Whether those are cloud services or hardware.\nIn case of hardware, provide detailed tables of the specs\nProject Scope\nThis section defines the expected project activities, and deliverables.\nThe following components are included in this SOW and referring to the maximum components per product.\nWork assumptions:\nElaborate all your working assumption which you expect the customer to be aware of.\nPhase 1: Project Kickoff\nThe Terasky engagement team will lead Chubb project sponsors and stakeholders in an engagement kickoff meeting to review expectations about the purpose of the engagement, the delivery approach, and timelines, the amount of time and effort required from the participants, expected schedule, activities and work products. Meeting objectives include the following:\nIntroduce the Terasky team, roles, and responsibilities.\nDescribe the project phases and agreement of key dates.\nAgree on communication and reporting processes.\nValidate the project expectations and clarify roles and responsibilities.\nExplain the expected project results.\nProvide key stakeholders with the required terminology and knowledge to discuss and make decisions throughout the design process.\nAttendance by key representatives from the various teams is considered mandatory.\nUse the session to facilitate discussions and provoke thought.\nRemind Chubb participants that the session is intended to give them a quick understanding of the solution so that they can participate in the next phase (which covers design).\nKeep a running list of questions and issues for consideration in the next phase.\nEnd the session by discussing, defining, and scheduling the subsequent detailed requirements gathering and design sessions\nPhase 2: Design Workshop\nTeraSky conducts design workshops to adopt customer environment requirement into a proper LLD and project plan. The workshop will include the following aspects:\n1\n2\n3\nFollowing the design workshop, Terasky professional services will create the LLD for the project along with a project workbook to gather all relevant system configurations.\nPhase 3: Environment setup / group of activities\nThe following table describe all the activities for this phase:\nPhase 4: Usability Test\nThe deliverables of phase 3 and 5 comprise the Beta version of the system. In order to finalize and promote to the GA version, it is a requirement to conduct a usability test on a designated group of users to test and validate the applicability of the features and user’s experience/satisfaction. \nThis phase will include the following:\nUsability test preparation – Chubb it to nominate a group of users. Those are “Usability Test Group Members”.\nDuring/post the usability test, Terasky professional services will modify/rectify the features according to the feedback of the usability test group members.\nThe changes are bound to the services and features stated in this document.\nAny other enhancement requests will be considered as “change management” and will be out of scope for this project.\nThe deliverables of this phase would be validation of user experience and measure satisfaction from the new services which were established during the project.\nPhase 5: Validation (Success Criteria’s)\nDuring this phase, the Terasky professional services works with the designated Chubb stakeholders to validate the cloud platform readiness for production from the infrastructure level:\nOn the infrastructure level – redundancy test.\nOn the services level - all services are applicable and functioning according to the design\nOn the operational level – all components are being monitored.\nAn Acceptance Test Procedure (ATP) will be defined for this stage. The ATP will be accepted by both Terasky and Chubb stakeholders prior to project implementation. The ATP will not exceed Five (5) days of Terasky consultant.\nPhase 6: Knowledge Transfer\nDuring this phase, Terasky professional services provides Chubb operators, administrators and users with a knowledge transfer session on the deployment and operating procedures.\nThe knowledge transfer sessions will include the following KT Packages:\nSubject 1\nSubject 2\nKnowledge transfer will be done in Israel (or remotely via Zoom or any other remote session tool) and will not exceed x (x) days of Terasky consultant.\nDeliverables\nThe following are the expected deliverables from the project phases:\nProject Low Level Design.\nCloud infrastructure installed and configured. This includes the following:\n1 x management WLD and 2 x VI WLD\nNSX-T installed and configured on all WLDs\nvSAN is configured on the management WLD while VI WLD are using central storage\nCloud management platform\nvRLI and vROPS collects data from all the new WLDs.\nK8s management packed is implemented within vROPS\nTanzu K8s monitoring and logging\nvROPS dashboards for K8s are implemented\nLogs from Tanzu K8s clusters are forwarded to vRLI\nPrometheus deployed and configured on all the new Tanzu clusters\nGrafana present dashboards on all the new Tanzu clusters\nHarbor is deployed and configured allowing Chubb to store images and HelmCharts.\nActive Directory is the identity source for Tanzu K8s clusters using vCenter SSO.\nChubb infrastructure administrators are equipt with all relevant knoledge to support the day to day operations of the entire VMware SDDC.\nChubb existing vRA is able to deploy cloud templates on the new WLD.\nChubb agile teams (DevOps, Developers,  so on and so forth)  are able to deploy K8s clusters as code.\nKnowledge Transfer session.\nOut Of Scope\nThe following items are not included in this SOW:\nCapabilities are limited to the current license level of VCF and Tanzu  at Chubb.\nAny 3rd party upgrades and compatibility which are not mentioned in the document.\nInstallation and configuration of custom or third-party applications and operating systems on deployed virtual machines / K8s clusters.\nOperating system administration including the operating system itself or any operating system features or components.\nManagement of change to virtual machines, operating systems, custom or third-party applications, databases, and administration of general network changes within Customer control.\nInstallation or configuration of other VMware or third party products not included in the scope of this document.\nInstallation and configuration of Customer-signed certificates.\nSolution capabilities will be limited to those provided by VMware products. Third-party product capabilities, which were not mentioned in this document, are not included.\nAny additional automations, workflows and blueprints which were not mentioned in this document.\nTemplates creation.\nCustom template for K8s nodes – we will use the default Photon OS.\nFirmware, BIOS and any other hardware related activities of equipment which are not mentioned in this document.\nDatabases installation and configuration.\nDisaster Recovery architecture for all components in the solution.\nLoad balancer installation and configurations other than those mentioned in the document\nCommercial Offering\nNotes:\nThe price does not include VAT\nAll with 3YRS vendor support\nThe offer is valid for 90 days\nTerms of payment- current+90 days\nThe payment is in ILS according to USD rate of exchange at the date of issuing the invoice"
  },
  {
    "template_name": "SOW Template v1.docx",
    "content": "< Project Name >\nStatement of Work\nVersion 1.0\ndd/mm/yyyy\nThe document is created by:\nName:\nTitle:\nEmail:\nPhone:\nTable of Contents\nAbout TeraSky Group\nTeraSky cuts through complexity to create masterful solutions for companies on their digital transformation journey.\nWhether you are a traditional business in need of digital transformation, or a born-to-the-cloud startup facing the challenges of expansion and scale, our elite team of forward thinkers and competent doers is your solution integration partner.\nYour Goals are our Expertise\nBeat the complexity of new technologies\nWe absorb the increasing complexity of new technologies, knowledge, and methodologies to help companies integrate solutions with simplicity and ease.\nMeet technical, operational, and financial targets\nWhether it’s lowering TCO, increasing availability, or improving compliance, we always see our customers’ goals as our own.\nAchieve successful and safe transformations\nTo ensure success, we drive smooth, safe, and cost-effective digital transformations all the way through, past deployment and onboarding to close.\nWhat We Do: We future-proof digital infrastructures through three primary areas of expertise:\nCloudStructures: Creating easily manageable infrastructures that seamlessly span clouds of any kind and data centers of any size.\nManaged Services\nPublic, private, multi & hybrid clouds\nCloud migration & optimization\nPaaS & cloud automation\nDaaS, Digital Workspaces and more\nManaged services\nAppSpheres: Building platforms for software creation, leveraging the new ways enterprise applications are produced, distributed, and consumed.\nKubernetes and container platforms\nMicroservices\nApp migration and PaaS\nManaged Services\nNewOps: Delivering frameworks, practices, and tools that help IT teams work more efficiently and effectively, without compromising security or data integrity.\nDevOps\nSecOps & DevSecOps\nMonitoring & optimization\nStorage, data protection & security\nManaged Services\nOur Values Drive Your Value\nThe quality of our work is driven by the quality of our people and the values we share. Having worked together for years, our team has cultivated unmatched expertise (what we know and keep on learning), supreme mastery (how we do things), and an uncompromising dedication to our customers.\nSolution Overview\nExecutive Summary\nThe executive summary includes the following: a high-level overview of the project; business and technical drivers for doing the project; and brief description of the customer's business and technical objectives.\nIn addition, we briefly summarize TeraSky professional services to be delivered to meet the customer’s objectives.\nCurrent customer status or challenges\nIn this part we will describe what is the status on the customer side – system in use, challenges, what is not working well, what we want to improve or allow the customer to achieve.\nProposed Solution\nDescribe our proposed solution from a technical architecture perspective.\nA description of the proposed high-level technical architecture should be included in the Statement of Work. It should address common architectural aspects such as: network infrastructure; data/process flows; software services/components; integration/messaging/middleware; security; deployment models; operations/support models. (As appropriate, based on the type of project).\nArchitectural diagram(s) that illustrate the proposed solution architecture should also be included in the Statement of Work. We usually do our best to use the most up-to-date Vendor/ Solution Icons to create architecture diagrams.\nThe document also includes tools being used/proposed to accomplish project deliverables.\nProposed Solution Diagram\nAdd a diagram to illustrate the architecture, flow or any other component that will convey the message.\nProject Overview\nScope of Work and expected deliverables\nIn the document we overview our approach, phases, tasks, etc. regarding how the project should be completed. We provide a list of items and activities as scope of the work expected to be accomplished. See below the example of the task list we use:\nKnowledge Transfer Definition\nKnowledge transfer is not product training.\nIf required, TeraSky can provide training for the involved products that will be included as a dedicated item of the SOW\nKnowledge transfer is focused on covering the deployed solutions and specifics of the current deployment\nKnowledge requirements: Familiarity with the product (engineer specify more details)\nAssumed that knowledge transfer is performed in a single session of up to one day\nOut of Scope\nAll discussed and considered out-of-scope items for the specific project should be documented and agreed upon before the engagement begins.\nProject Success Criteria (only for POC)\nWe provide a bulleted list of essential items for the project's success. The project's critical business and technical objectives are described quantitatively and measurably to be defined and measured for the project’s success.\nAssumptions\nWe create a clear list with all available and known prerequisites, dependencies, constraints, or assumptions for project execution.  We must ensure that any significant external dependencies the project must rely upon for success, such as specific technologies, third-party vendors, development resources, or other business relationships, are considered. Any business or technical constraints that exist which might impact on the project’s completion are taken into consideration.\nAcceptance Criteria (ATP/UAT)\nPrior to beginning the project execution, both TeraSky and the Customer define the acceptance process and criteria. The way of how the customer reviews, evaluates, tests the applicable deliverables and “acceptance period” to determine whether each deliverables satisfies the acceptance criteria for deliverables in all material respects; etc.\nIf the deliverable satisfies its acceptance criteria in all material respects, the customer should provide a written acceptance confirmation to TeraSky via the Acceptance Form prior to the end of the Acceptance Period.\nPricing\nThe project will be charged based on the agreed deliverables milestones according to the following structure:\n***INTERNAL NOTE - PAY ATTENTION ***\nWhen setting the milestones, remember to set a process where we can charge every month and adjust the significant deliverable timeframe to allow MONTHLY CHARGE.\nPricing assumptions and conditions:\nBusiness working hours:\nSunday through Thursday, 10:00 – 18:00\nOut-of-business hours definition and rates:\nSunday – Thursday 18:00 – 08:00 – 150%\nWeekend (Friday – Saturday) – 150%\nPublic holidays – 200%\nThe estimate of the project pricing and completion time assumes we will work full-days – not less than 8 hours.\nPayment will be per milestone completion.\nThe prices are in USD and do not include VAT.\nThe offer is valid for 30 days (The offer is valid until June 30th, 2023).\nTerms of payment- EOM+ 30 days\nThe payment is in ILS according to the USD / ILS rate of exchange at the date of issuing the invoice.\nFor T&M-based work:\nThe charge will be made at the end of each month according to the usage report.\nOption A: The payment for the days' bank will be charged monthly.\nOption B: The payment for the days' bank will be charged upfront.\nMinimum charging terms:\nOn-site arrival – 0.5 day\nRemote – 1 hour\nService Terms and Conditions\nThe following Terms and Conditions (“T&C”) shall apply, govern and be incorporated into any and all Offers, Purchase Order and/or Statements of Work (“SOW”) to which they are referenced, and shall supersede any and all other terms included in such documents.\nACCEPTANCE\nUpon execution of any Purchase Order and/or SOW Customer and TeraSky adopt and accept these T&C.\nSERVICES AND DELIVERABLES\nTeraSky shall perform the services and provide the deliverables (individually and collectively, the “Deliverables”) according to the specifications agreed by the parties and listed in the relevant Purchase Order and/or SOW.\nTERASKY WARRANTIES\nSubject to the terms of these T&C, TeraSky represents and warrants that the Deliverables shall (a) comply materially with the specifications and requirements set forth in the SOW for a period of one-hundred eighty (180) days from date of delivery; (b) be of high industry standard quality and be performed in a timely and professional manner; (c) be free from faulty design, workmanship and material; and (d) be performed in accordance with all applicable laws.\nDISCLAIMER OF WARRANTIES\nExcept as expressly stated above TeraSky provides the Deliverables on a best efforts basis and all other warranties are specifically excluded, including but not limited to implied warranty of merchantability, fitness for a particular purpose or no infringement.\nCUSTOMER DATA\nTeraSky is not responsible or liable for the deletion of or failure to store any Customer data and other communications maintained or transmitted through use of the Deliverables, Customer is solely responsible for securing and backing up its application, project and Customer Data, TeraSky does not warrant that the operation of the Deliverables will be error free or uninterrupted.\nLIMITATION OF LIABILITY\nTeraSky will not be liable to the Customer or any third party for special, indirect or consequential damages incurred or suffered by the Customer or any third party, arising as a result of or related to the performance of the Deliverables, whether in contract, tort or otherwise. In no event will TeraSky`s aggregate cumulative liability for any claims arising out of or relation to the Deliverables exceed the total fees actually paid to TeraSky by Customer for the Deliverables in respect for the semi-annual period (six (6) months) prior to the date the claim arises.\nINDEMNIFICATION\nEach party shall indemnify and hold harmless the other party and its subsidiary companies and its respective employees, officers, directors, authorized representatives and stockholders from all claims, costs, liabilities, judgments, expenses, damages or losses resulting from any injury to property or persons due to any act, omission or negligence of such party , its agents, employees or contractors or arising out of its performance of the Purchase Order and/or these T&C or arising out of any breach or alleged breach of the Purchase Order and/or these T&C or any representation or warranty made by such party, its agents, employees or contractors.\nCONFIDENTIALITY\nEach party shall hold the Confidential Information of the other in confidence and protect the same with at least the same degree of care, but no less than reasonable care, with which it protects its own most sensitive confidential information. Each party shall use the Confidential Information of the other solely in connection with the exercise of its rights and the performance of its obligations under the Purchase Order and/or any SOW, and shall restrict disclosure of and access to the Confidential Information of the other to such party's personnel, agents and contractors that require access to such Confidential Information in connection with the Purchase Order. Each party shall require its personnel, agents and contractors to comply with the obligations of confidentiality set forth herein and shall be liable for any failure to so comply.\nTERM AND TERMINATION\nThe term shall be as set forth in the Purchase Order and/or any SOW, unless earlier terminated in as set forth herein. Either party may terminate these T&C upon written notice (a) if the other party becomes insolvent or ceases paying debts, becomes subject to any proceedings under any bankruptcy or insolvency law, or suffers any similar action in consequence of debt, or (b) if the other party materially breaches these T&C and fails to correct the material breach within thirty (30) days following written notice specifying the material breach and demanding its cure.\nMISCELLANEOUS\nThese T&C, together with the Purchase Order and/or any SOW, constitute the full and entire understanding and agreement between TeraSky and Customer and replaces any previous agreement and/or communications between the parties;\nThese T&C shall not be amended, modified or varied by any oral agreement or representation or otherwise then by written instrument executed by both parties or their duly authorized representatives;\nNo failure, delay or forbearance of either party in exercising any power or right hereunder shall in any way restrict or diminish such party’s rights and powers under these T&C or operate as a waiver of any breach or non-performance by either party of any of the terms or conditions hereof;\nAll notices shall be in writing addressed as set forth on the Purchase Order or as otherwise specified by a party in writing, and shall be deemed validly given or served (a) upon personal delivery, (b) confirmed email delivery to the other party,\nThe laws of the State of Israel shall apply to these T&C and the sole exclusive place of jurisdiction in any matter arising out of or connected with these T&C, Purchase Order or/any Sow shall be the competent courts in Tel Aviv-Yafo.\nName of Customer\nBy:\nTitle:\nDate:"
  },
  {
    "template_name": "SOW Template v2.docx",
    "content": "< Project Name >\nStatement of Work\nVersion 1.0\ndd/mm/yyyy\nThe document is created by:\nName:\nTitle:\nEmail:\nPhone:\nTable of Contents\nAbout TeraSky Group\nTeraSky cuts through complexity to create masterful solutions for companies on their digital transformation journey.\nWhether you are a traditional business in need of digital transformation, or a born-to-the-cloud startup facing the challenges of expansion and scale, our elite team of forward thinkers and competent doers is your solution integration partner.\nYour Goals are our Expertise\nBeat the complexity of new technologies\nWe absorb the increasing complexity of new technologies, knowledge, and methodologies to help companies integrate solutions with simplicity and ease.\nMeet technical, operational, and financial targets\nWhether it’s lowering TCO, increasing availability, or improving compliance, we always see our customers’ goals as our own.\nAchieve successful and safe transformations\nTo ensure success, we drive smooth, safe, and cost-effective digital transformations all the way through, past deployment and onboarding to close.\nWhat We Do: We future-proof digital infrastructures through three primary areas of expertise:\nCloudStructures: Creating easily manageable infrastructures that seamlessly span clouds of any kind and data centers of any size.\nManaged Services\nPublic, private, multi & hybrid clouds\nCloud migration & optimization\nPaaS & cloud automation\nDaaS, Digital Workspaces and more\nManaged services\nAppSpheres: Building platforms for software creation, leveraging the new ways enterprise applications are produced, distributed, and consumed.\nKubernetes and container platforms\nMicroservices\nApp migration and PaaS\nManaged Services\nNewOps: Delivering frameworks, practices, and tools that help IT teams work more efficiently and effectively, without compromising security or data integrity.\nDevOps\nSecOps & DevSecOps\nMonitoring & optimization\nStorage, data protection & security\nManaged Services\nOur Values Drive Your Value\nThe quality of our work is driven by the quality of our people and the values we share. Having worked together for years, our team has cultivated unmatched expertise (what we know and keep on learning), supreme mastery (how we do things), and an uncompromising dedication to our customers.\nSolution Overview\nExecutive Summary\nThe executive summary includes the following: a high-level overview of the project; business and technical drivers for doing the project; and brief description of the customer's business and technical objectives.\nIn addition, we briefly summarize TeraSky professional services to be delivered to meet the customer’s objectives.\nCurrent customer status or challenges\nIn this part we will describe what is the status on the customer side – system in use, challenges, what is not working well, what we want to improve or allow the customer to achieve.\nProposed Solution\nDescribe our proposed solution from a technical architecture perspective.\nA description of the proposed high-level technical architecture should be included in the Statement of Work. It should address common architectural aspects such as: network infrastructure; data/process flows; software services/components; integration/messaging/middleware; security; deployment models; operations/support models. (As appropriate, based on the type of project).\nArchitectural diagram(s) that illustrate the proposed solution architecture should also be included in the Statement of Work. We usually do our best to use the most up-to-date Vendor/ Solution Icons to create architecture diagrams.\nThe document also includes tools being used/proposed to accomplish project deliverables.\nProposed Solution Diagram\nAdd a diagram to illustrate the architecture, flow or any other component that will convey the message.\nProject Overview\nScope of Work and expected deliverables\nIn the document we overview our approach, phases, tasks, etc. regarding how the project should be completed. We provide a list of items and activities as scope of the work expected to be accomplished. See below the example of the task list we use:\nKnowledge Transfer Definition\nKnowledge transfer is not product training.\nIf required, TeraSky can provide training for the involved products that will be included as a dedicated item of the SOW\nKnowledge transfer is focused on covering the deployed solutions and specifics of the current deployment\nKnowledge requirements: Familiarity with the product (engineer specify more details)\nAssumed that knowledge transfer is performed in a single session of up to one day\nOut of Scope\nAll discussed and considered out-of-scope items for the specific project should be documented and agreed upon before the engagement begins.\nProject Success Criteria (only for POC)\nWe provide a bulleted list of essential items for the project's success. The project's critical business and technical objectives are described quantitatively and measurably to be defined and measured for the project’s success.\nAssumptions\nWe create a clear list with all available and known prerequisites, dependencies, constraints, or assumptions for project execution.  We must ensure that any significant external dependencies the project must rely upon for success, such as specific technologies, third-party vendors, development resources, or other business relationships, are considered. Any business or technical constraints that exist which might impact on the project’s completion are taken into consideration.\nAcceptance Criteria (ATP/UAT)\nPrior to beginning the project execution, both TeraSky and the Customer define the acceptance process and criteria. The way of how the customer reviews, evaluates, tests the applicable deliverables and “acceptance period” to determine whether each deliverables satisfies the acceptance criteria for deliverables in all material respects; etc.\nIf the deliverable satisfies its acceptance criteria in all material respects, the customer should provide a written acceptance confirmation to TeraSky via the Acceptance Form prior to the end of the Acceptance Period.\nPricing\nThe project will be charged based on the agreed deliverables milestones according to the following structure:\n***INTERNAL NOTE - PAY ATTENTION ***\nWhen setting the milestones, remember to set a process where we can charge every month and adjust the significant deliverable timeframe to allow MONTHLY CHARGE.\nPricing assumptions and conditions:\nBusiness working hours:\nSunday through Thursday, 10:00 – 18:00\nOut-of-business hours definition and rates:\nSunday – Thursday 18:00 – 08:00 – 150%\nWeekend (Friday – Saturday) – 150%\nPublic holidays – 200%\nThe estimate of the project pricing and completion time assumes we will work full-days – not less than 8 hours.\nPayment will be per milestone completion.\nThe prices are in USD and do not include VAT.\nThe offer is valid for 30 days (The offer is valid until June 30th, 2023).\nTerms of payment- EOM+ 30 days\nThe payment is in ILS according to the USD / ILS rate of exchange at the date of issuing the invoice.\nFor T&M-based work:\nThe charge will be made at the end of each month according to the usage report.\nOption A: The payment for the days' bank will be charged monthly.\nOption B: The payment for the days' bank will be charged upfront.\nMinimum charging terms:\nOn-site arrival – 0.5 day\nRemote – 1 hour\nService Terms and Conditions\nThe following Terms and Conditions (“T&C”) shall apply, govern and be incorporated into any and all Offers, Purchase Order and/or Statements of Work (“SOW”) to which they are referenced, and shall supersede any and all other terms included in such documents.\nACCEPTANCE\nUpon execution of any Purchase Order and/or SOW Customer and TeraSky adopt and accept these T&C.\nSERVICES AND DELIVERABLES\nTeraSky shall perform the services and provide the deliverables (individually and collectively, the “Deliverables”) according to the specifications agreed by the parties and listed in the relevant Purchase Order and/or SOW.\nTERASKY WARRANTIES\nSubject to the terms of these T&C, TeraSky represents and warrants that the Deliverables shall (a) comply materially with the specifications and requirements set forth in the SOW for a period of one-hundred eighty (180) days from date of delivery; (b) be of high industry standard quality and be performed in a timely and professional manner; (c) be free from faulty design, workmanship and material; and (d) be performed in accordance with all applicable laws.\nDISCLAIMER OF WARRANTIES\nExcept as expressly stated above TeraSky provides the Deliverables on a best efforts basis and all other warranties are specifically excluded, including but not limited to implied warranty of merchantability, fitness for a particular purpose or no infringement.\nCUSTOMER DATA\nTeraSky is not responsible or liable for the deletion of or failure to store any Customer data and other communications maintained or transmitted through use of the Deliverables, Customer is solely responsible for securing and backing up its application, project and Customer Data, TeraSky does not warrant that the operation of the Deliverables will be error free or uninterrupted.\nLIMITATION OF LIABILITY\nTeraSky will not be liable to the Customer or any third party for special, indirect or consequential damages incurred or suffered by the Customer or any third party, arising as a result of or related to the performance of the Deliverables, whether in contract, tort or otherwise. In no event will TeraSky`s aggregate cumulative liability for any claims arising out of or relation to the Deliverables exceed the total fees actually paid to TeraSky by Customer for the Deliverables in respect for the semi-annual period (six (6) months) prior to the date the claim arises.\nINDEMNIFICATION\nEach party shall indemnify and hold harmless the other party and its subsidiary companies and its respective employees, officers, directors, authorized representatives and stockholders from all claims, costs, liabilities, judgments, expenses, damages or losses resulting from any injury to property or persons due to any act, omission or negligence of such party , its agents, employees or contractors or arising out of its performance of the Purchase Order and/or these T&C or arising out of any breach or alleged breach of the Purchase Order and/or these T&C or any representation or warranty made by such party, its agents, employees or contractors.\nCONFIDENTIALITY\nEach party shall hold the Confidential Information of the other in confidence and protect the same with at least the same degree of care, but no less than reasonable care, with which it protects its own most sensitive confidential information. Each party shall use the Confidential Information of the other solely in connection with the exercise of its rights and the performance of its obligations under the Purchase Order and/or any SOW, and shall restrict disclosure of and access to the Confidential Information of the other to such party's personnel, agents and contractors that require access to such Confidential Information in connection with the Purchase Order. Each party shall require its personnel, agents and contractors to comply with the obligations of confidentiality set forth herein and shall be liable for any failure to so comply.\nTERM AND TERMINATION\nThe term shall be as set forth in the Purchase Order and/or any SOW, unless earlier terminated in as set forth herein. Either party may terminate these T&C upon written notice (a) if the other party becomes insolvent or ceases paying debts, becomes subject to any proceedings under any bankruptcy or insolvency law, or suffers any similar action in consequence of debt, or (b) if the other party materially breaches these T&C and fails to correct the material breach within thirty (30) days following written notice specifying the material breach and demanding its cure.\nMISCELLANEOUS\nThese T&C, together with the Purchase Order and/or any SOW, constitute the full and entire understanding and agreement between TeraSky and Customer and replaces any previous agreement and/or communications between the parties;\nThese T&C shall not be amended, modified or varied by any oral agreement or representation or otherwise then by written instrument executed by both parties or their duly authorized representatives;\nNo failure, delay or forbearance of either party in exercising any power or right hereunder shall in any way restrict or diminish such party’s rights and powers under these T&C or operate as a waiver of any breach or non-performance by either party of any of the terms or conditions hereof;\nAll notices shall be in writing addressed as set forth on the Purchase Order or as otherwise specified by a party in writing, and shall be deemed validly given or served (a) upon personal delivery, (b) confirmed email delivery to the other party,\nThe laws of the State of Israel shall apply to these T&C and the sole exclusive place of jurisdiction in any matter arising out of or connected with these T&C, Purchase Order or/any Sow shall be the competent courts in Tel Aviv-Yafo.\nName of Customer\nBy:\nTitle:\nDate:"
  },
  {
    "template_name": "SOW Template v3.docx",
    "content": "< Project Name >\nStatement of Work\nVersion 1.0\ndd/mm/yyyy\nThe document is created by:\nName:\nTitle:\nEmail:\nPhone:\nTable of Contents\nAbout TeraSky Group\nTeraSky cuts through complexity to create masterful solutions for companies on their digital transformation journey.\nWhether you are a traditional business in need of digital transformation, or a born-to-the-cloud startup facing the challenges of expansion and scale, our elite team of forward thinkers and competent doers is your solution integration partner.\nYour Goals are our Expertise\nBeat the complexity of new technologies\nWe absorb the increasing complexity of new technologies, knowledge, and methodologies to help companies integrate solutions with simplicity and ease.\nMeet technical, operational, and financial targets\nWhether it’s lowering TCO, increasing availability, or improving compliance, we always see our customers’ goals as our own.\nAchieve successful and safe transformations\nTo ensure success, we drive smooth, safe, and cost-effective digital transformations all the way through, past deployment and onboarding to close.\nWhat We Do: We future-proof digital infrastructures through three primary areas of expertise:\nCloudStructures: Creating easily manageable infrastructures that seamlessly span clouds of any kind and data centers of any size.\nManaged Services\nPublic, private, multi & hybrid clouds\nCloud migration & optimization\nPaaS & cloud automation\nDaaS, Digital Workspaces and more\nManaged services\nAppSpheres: Building platforms for software creation, leveraging the new ways enterprise applications are produced, distributed, and consumed.\nKubernetes and container platforms\nMicroservices\nApp migration and PaaS\nManaged Services\nNewOps: Delivering frameworks, practices, and tools that help IT teams work more efficiently and effectively, without compromising security or data integrity.\nDevOps\nSecOps & DevSecOps\nMonitoring & optimization\nStorage, data protection & security\nManaged Services\nOur Values Drive Your Value\nThe quality of our work is driven by the quality of our people and the values we share. Having worked together for years, our team has cultivated unmatched expertise (what we know and keep on learning), supreme mastery (how we do things), and an uncompromising dedication to our customers.\nSolution Overview\nExecutive Summary\nThe executive summary includes the following: a high-level overview of the project; business and technical drivers for doing the project; and brief description of the customer's business and technical objectives.\nIn addition, we briefly summarize TeraSky professional services to be delivered to meet the customer’s objectives.\nCurrent customer status or challenges\nIn this part we will describe what is the status on the customer side – system in use, challenges, what is not working well, what we want to improve or allow the customer to achieve.\nProposed Solution\nDescribe our proposed solution from a technical architecture perspective.\nA description of the proposed high-level technical architecture should be included in the Statement of Work. It should address common architectural aspects such as: network infrastructure; data/process flows; software services/components; integration/messaging/middleware; security; deployment models; operations/support models. (As appropriate, based on the type of project).\nArchitectural diagram(s) that illustrate the proposed solution architecture should also be included in the Statement of Work. We usually do our best to use the most up-to-date Vendor/ Solution Icons to create architecture diagrams.\nThe document also includes tools being used/proposed to accomplish project deliverables.\nProposed Solution Diagram\nAdd a diagram to illustrate the architecture, flow or any other component that will convey the message.\nProject Overview\nScope of Work and expected deliverables\nIn the document we overview our approach, phases, tasks, etc. regarding how the project should be completed. We provide a list of items and activities as scope of the work expected to be accomplished. See below the example of the task list we use:\nKnowledge Transfer Definition\nKnowledge transfer is not product training.\nIf required, TeraSky can provide training for the involved products that will be included as a dedicated item of the SOW\nKnowledge transfer is focused on covering the deployed solutions and specifics of the current deployment\nKnowledge requirements: Familiarity with the product (engineer specify more details)\nAssumed that knowledge transfer is performed in a single session of up to one day\nOut of Scope\nAll discussed and considered out-of-scope items for the specific project should be documented and agreed upon before the engagement begins.\nProject Success Criteria (only for POC)\nWe provide a bulleted list of essential items for the project's success. The project's critical business and technical objectives are described quantitatively and measurably to be defined and measured for the project’s success.\nAssumptions\nWe create a clear list with all available and known prerequisites, dependencies, constraints, or assumptions for project execution.  We must ensure that any significant external dependencies the project must rely upon for success, such as specific technologies, third-party vendors, development resources, or other business relationships, are considered. Any business or technical constraints that exist which might impact on the project’s completion are taken into consideration.\nAcceptance Criteria (ATP/UAT)\nPrior to beginning the project execution, both TeraSky and the Customer define the acceptance process and criteria. The way of how the customer reviews, evaluates, tests the applicable deliverables and “acceptance period” to determine whether each deliverables satisfies the acceptance criteria for deliverables in all material respects; etc.\nIf the deliverable satisfies its acceptance criteria in all material respects, the customer should provide a written acceptance confirmation to TeraSky via the Acceptance Form prior to the end of the Acceptance Period.\nPricing\nThe project will be charged based on the agreed deliverables milestones according to the following structure:\n***INTERNAL NOTE - PAY ATTENTION ***\nWhen setting the milestones, remember to set a process where we can charge every month and adjust the significant deliverable timeframe to allow MONTHLY CHARGE.\nPricing assumptions and conditions:\nBusiness working hours:\nSunday through Thursday, 10:00 – 18:00\nOut-of-business hours definition and rates:\nSunday – Thursday 18:00 – 08:00 – 150%\nWeekend (Friday – Saturday) – 150%\nPublic holidays – 200%\nThe estimate of the project pricing and completion time assumes we will work full-days – not less than 8 hours.\nPayment will be per milestone completion.\nThe prices are in USD and do not include VAT.\nThe offer is valid for 30 days (The offer is valid until June 30th, 2023).\nTerms of payment- EOM+ 30 days\nThe payment is in ILS according to the USD / ILS rate of exchange at the date of issuing the invoice.\nFor T&M-based work:\nThe charge will be made at the end of each month according to the usage report.\nOption A: The payment for the days' bank will be charged monthly.\nOption B: The payment for the days' bank will be charged upfront.\nMinimum charging terms:\nOn-site arrival – 0.5 day\nRemote – 1 hour\nService Terms and Conditions\nThe following Terms and Conditions (“T&C”) shall apply, govern and be incorporated into any and all Offers, Purchase Order and/or Statements of Work (“SOW”) to which they are referenced, and shall supersede any and all other terms included in such documents.\nACCEPTANCE\nUpon execution of any Purchase Order and/or SOW Customer and TeraSky adopt and accept these T&C.\nSERVICES AND DELIVERABLES\nTeraSky shall perform the services and provide the deliverables (individually and collectively, the “Deliverables”) according to the specifications agreed by the parties and listed in the relevant Purchase Order and/or SOW.\nTERASKY WARRANTIES\nSubject to the terms of these T&C, TeraSky represents and warrants that the Deliverables shall (a) comply materially with the specifications and requirements set forth in the SOW for a period of one-hundred eighty (180) days from date of delivery; (b) be of high industry standard quality and be performed in a timely and professional manner; (c) be free from faulty design, workmanship and material; and (d) be performed in accordance with all applicable laws.\nDISCLAIMER OF WARRANTIES\nExcept as expressly stated above TeraSky provides the Deliverables on a best efforts basis and all other warranties are specifically excluded, including but not limited to implied warranty of merchantability, fitness for a particular purpose or no infringement.\nCUSTOMER DATA\nTeraSky is not responsible or liable for the deletion of or failure to store any Customer data and other communications maintained or transmitted through use of the Deliverables, Customer is solely responsible for securing and backing up its application, project and Customer Data, TeraSky does not warrant that the operation of the Deliverables will be error free or uninterrupted.\nLIMITATION OF LIABILITY\nTeraSky will not be liable to the Customer or any third party for special, indirect or consequential damages incurred or suffered by the Customer or any third party, arising as a result of or related to the performance of the Deliverables, whether in contract, tort or otherwise. In no event will TeraSky`s aggregate cumulative liability for any claims arising out of or relation to the Deliverables exceed the total fees actually paid to TeraSky by Customer for the Deliverables in respect for the semi-annual period (six (6) months) prior to the date the claim arises.\nINDEMNIFICATION\nEach party shall indemnify and hold harmless the other party and its subsidiary companies and its respective employees, officers, directors, authorized representatives and stockholders from all claims, costs, liabilities, judgments, expenses, damages or losses resulting from any injury to property or persons due to any act, omission or negligence of such party , its agents, employees or contractors or arising out of its performance of the Purchase Order and/or these T&C or arising out of any breach or alleged breach of the Purchase Order and/or these T&C or any representation or warranty made by such party, its agents, employees or contractors.\nCONFIDENTIALITY\nEach party shall hold the Confidential Information of the other in confidence and protect the same with at least the same degree of care, but no less than reasonable care, with which it protects its own most sensitive confidential information. Each party shall use the Confidential Information of the other solely in connection with the exercise of its rights and the performance of its obligations under the Purchase Order and/or any SOW, and shall restrict disclosure of and access to the Confidential Information of the other to such party's personnel, agents and contractors that require access to such Confidential Information in connection with the Purchase Order. Each party shall require its personnel, agents and contractors to comply with the obligations of confidentiality set forth herein and shall be liable for any failure to so comply.\nTERM AND TERMINATION\nThe term shall be as set forth in the Purchase Order and/or any SOW, unless earlier terminated in as set forth herein. Either party may terminate these T&C upon written notice (a) if the other party becomes insolvent or ceases paying debts, becomes subject to any proceedings under any bankruptcy or insolvency law, or suffers any similar action in consequence of debt, or (b) if the other party materially breaches these T&C and fails to correct the material breach within thirty (30) days following written notice specifying the material breach and demanding its cure.\nMISCELLANEOUS\nThese T&C, together with the Purchase Order and/or any SOW, constitute the full and entire understanding and agreement between TeraSky and Customer and replaces any previous agreement and/or communications between the parties;\nThese T&C shall not be amended, modified or varied by any oral agreement or representation or otherwise then by written instrument executed by both parties or their duly authorized representatives;\nNo failure, delay or forbearance of either party in exercising any power or right hereunder shall in any way restrict or diminish such party’s rights and powers under these T&C or operate as a waiver of any breach or non-performance by either party of any of the terms or conditions hereof;\nAll notices shall be in writing addressed as set forth on the Purchase Order or as otherwise specified by a party in writing, and shall be deemed validly given or served (a) upon personal delivery, (b) confirmed email delivery to the other party,\nThe laws of the State of Israel shall apply to these T&C and the sole exclusive place of jurisdiction in any matter arising out of or connected with these T&C, Purchase Order or/any Sow shall be the competent courts in Tel Aviv-Yafo.\nName of Customer\nBy:\nTitle:\nDate:"
  },
  {
    "template_name": "SOW Template v4.docx",
    "content": "< Project Name >\nStatement of Work\nVersion 1.0\ndd/mm/yyyy\nThe document is created by:\nName:\nTitle:\nEmail:\nPhone:\nTable of Contents\nAbout TeraSky Group\nTeraSky cuts through complexity to create masterful solutions for companies on their digital transformation journey.\nWhether you are a traditional business in need of digital transformation, or a born-to-the-cloud startup facing the challenges of expansion and scale, our elite team of forward thinkers and competent doers is your solution integration partner.\nYour Goals are our Expertise\nBeat the complexity of new technologies\nWe absorb the increasing complexity of new technologies, knowledge, and methodologies to help companies integrate solutions with simplicity and ease.\nMeet technical, operational, and financial targets\nWhether it’s lowering TCO, increasing availability, or improving compliance, we always see our customers’ goals as our own.\nAchieve successful and safe transformations\nTo ensure success, we drive smooth, safe, and cost-effective digital transformations all the way through, past deployment and onboarding to close.\nWhat We Do: We future-proof digital infrastructures through three primary areas of expertise:\nCloudStructures: Creating easily manageable infrastructures that seamlessly span clouds of any kind and data centers of any size.\nManaged Services\nPublic, private, multi & hybrid clouds\nCloud migration & optimization\nPaaS & cloud automation\nDaaS, Digital Workspaces and more\nManaged services\nAppSpheres: Building platforms for software creation, leveraging the new ways enterprise applications are produced, distributed, and consumed.\nKubernetes and container platforms\nMicroservices\nApp migration and PaaS\nManaged Services\nNewOps: Delivering frameworks, practices, and tools that help IT teams work more efficiently and effectively, without compromising security or data integrity.\nDevOps\nSecOps & DevSecOps\nMonitoring & optimization\nStorage, data protection & security\nManaged Services\nOur Values Drive Your Value\nThe quality of our work is driven by the quality of our people and the values we share. Having worked together for years, our team has cultivated unmatched expertise (what we know and keep on learning), supreme mastery (how we do things), and an uncompromising dedication to our customers.\nSolution Overview\nExecutive Summary\nThe executive summary includes the following: a high-level overview of the project; business and technical drivers for doing the project; and brief description of the customer's business and technical objectives.\nIn addition, we briefly summarize TeraSky professional services to be delivered to meet the customer’s objectives.\nCurrent customer status or challenges\nIn this part we will describe what is the status on the customer side – system in use, challenges, what is not working well, what we want to improve or allow the customer to achieve.\nProposed Solution\nDescribe our proposed solution from a technical architecture perspective.\nA description of the proposed high-level technical architecture should be included in the Statement of Work. It should address common architectural aspects such as: network infrastructure; data/process flows; software services/components; integration/messaging/middleware; security; deployment models; operations/support models. (As appropriate, based on the type of project).\nArchitectural diagram(s) that illustrate the proposed solution architecture should also be included in the Statement of Work. We usually do our best to use the most up-to-date Vendor/ Solution Icons to create architecture diagrams.\nThe document also includes tools being used/proposed to accomplish project deliverables.\nProposed Solution Diagram\nAdd a diagram to illustrate the architecture, flow or any other component that will convey the message.\nProject Overview\nScope of Work and expected deliverables\nIn the document we overview our approach, phases, tasks, etc. regarding how the project should be completed. We provide a list of items and activities as scope of the work expected to be accomplished. See below the example of the task list we use:\nKnowledge Transfer Definition\nKnowledge transfer is not product training.\nIf required, TeraSky can provide training for the involved products that will be included as a dedicated item of the SOW\nKnowledge transfer is focused on covering the deployed solutions and specifics of the current deployment\nKnowledge requirements: Familiarity with the product (engineer specify more details)\nAssumed that knowledge transfer is performed in a single session of up to one day\nOut of Scope\nAll discussed and considered out-of-scope items for the specific project should be documented and agreed upon before the engagement begins.\nProject Success Criteria (only for POC)\nWe provide a bulleted list of essential items for the project's success. The project's critical business and technical objectives are described quantitatively and measurably to be defined and measured for the project’s success.\nAssumptions\nWe create a clear list with all available and known prerequisites, dependencies, constraints, or assumptions for project execution.  We must ensure that any significant external dependencies the project must rely upon for success, such as specific technologies, third-party vendors, development resources, or other business relationships, are considered. Any business or technical constraints that exist which might impact on the project’s completion are taken into consideration.\nAcceptance Criteria (ATP/UAT)\nPrior to beginning the project execution, both TeraSky and the Customer define the acceptance process and criteria. The way of how the customer reviews, evaluates, tests the applicable deliverables and “acceptance period” to determine whether each deliverables satisfies the acceptance criteria for deliverables in all material respects; etc.\nIf the deliverable satisfies its acceptance criteria in all material respects, the customer should provide a written acceptance confirmation to TeraSky via the Acceptance Form prior to the end of the Acceptance Period.\nPricing\nThe project will be charged based on the agreed deliverables milestones according to the following structure:\n***INTERNAL NOTE - PAY ATTENTION ***\nWhen setting the milestones, remember to set a process where we can charge every month and adjust the significant deliverable timeframe to allow MONTHLY CHARGE.\nPricing assumptions and conditions:\nBusiness working hours:\nSunday through Thursday, 10:00 – 18:00\nOut-of-business hours definition and rates:\nSunday – Thursday 18:00 – 08:00 – 150%\nWeekend (Friday – Saturday) – 150%\nPublic holidays – 200%\nThe estimate of the project pricing and completion time assumes we will work full days – not less than 8 hours.\nPayment will be per milestone completion.\nAny additional requirements on the above-mentioned will add additional costs.\nThe prices are in USD and do not include VAT.\nThe offer is valid for 30 days (The offer is valid until June 30th, 2023).\nTerms of payment- EOM+ 30 days\nThe payment is in ILS according to the USD / ILS rate of exchange at the date of issuing the invoice.\nFor T&M-based work:\nThe charge will be made at the end of each month according to the usage report.\nOption A: The payment for the days' bank will be charged monthly.\nOption B: The payment for the days' bank will be charged upfront.\nMinimum charging terms:\nOn-site arrival – 0.5 day\nRemote – 1 hour\nService Terms and Conditions\nThe following Terms and Conditions (“T&C”) shall apply, govern and be incorporated into any and all Offers, Purchase Order and/or Statements of Work (“SOW”) to which they are referenced, and shall supersede any and all other terms included in such documents.\nACCEPTANCE\nUpon execution of any Purchase Order and/or SOW Customer and TeraSky adopt and accept these T&C.\nSERVICES AND DELIVERABLES\nTeraSky shall perform the services and provide the deliverables (individually and collectively, the “Deliverables”) according to the specifications agreed by the parties and listed in the relevant Purchase Order and/or SOW.\nTERASKY WARRANTIES\nSubject to the terms of these T&C, TeraSky represents and warrants that the Deliverables shall (a) comply materially with the specifications and requirements set forth in the SOW for a period of one-hundred eighty (180) days from date of delivery; (b) be of high industry standard quality and be performed in a timely and professional manner; (c) be free from faulty design, workmanship and material; and (d) be performed in accordance with all applicable laws.\nDISCLAIMER OF WARRANTIES\nExcept as expressly stated above TeraSky provides the Deliverables on a best efforts basis and all other warranties are specifically excluded, including but not limited to implied warranty of merchantability, fitness for a particular purpose or no infringement.\nCUSTOMER DATA\nTeraSky is not responsible or liable for the deletion of or failure to store any Customer data and other communications maintained or transmitted through use of the Deliverables, Customer is solely responsible for securing and backing up its application, project and Customer Data, TeraSky does not warrant that the operation of the Deliverables will be error free or uninterrupted.\nLIMITATION OF LIABILITY\nTeraSky will not be liable to the Customer or any third party for special, indirect or consequential damages incurred or suffered by the Customer or any third party, arising as a result of or related to the performance of the Deliverables, whether in contract, tort or otherwise. In no event will TeraSky`s aggregate cumulative liability for any claims arising out of or relation to the Deliverables exceed the total fees actually paid to TeraSky by Customer for the Deliverables in respect for the semi-annual period (six (6) months) prior to the date the claim arises.\nINDEMNIFICATION\nEach party shall indemnify and hold harmless the other party and its subsidiary companies and its respective employees, officers, directors, authorized representatives and stockholders from all claims, costs, liabilities, judgments, expenses, damages or losses resulting from any injury to property or persons due to any act, omission or negligence of such party , its agents, employees or contractors or arising out of its performance of the Purchase Order and/or these T&C or arising out of any breach or alleged breach of the Purchase Order and/or these T&C or any representation or warranty made by such party, its agents, employees or contractors.\nCONFIDENTIALITY\nEach party shall hold the Confidential Information of the other in confidence and protect the same with at least the same degree of care, but no less than reasonable care, with which it protects its own most sensitive confidential information. Each party shall use the Confidential Information of the other solely in connection with the exercise of its rights and the performance of its obligations under the Purchase Order and/or any SOW, and shall restrict disclosure of and access to the Confidential Information of the other to such party's personnel, agents and contractors that require access to such Confidential Information in connection with the Purchase Order. Each party shall require its personnel, agents and contractors to comply with the obligations of confidentiality set forth herein and shall be liable for any failure to so comply.\nTERM AND TERMINATION\nThe term shall be as set forth in the Purchase Order and/or any SOW, unless earlier terminated in as set forth herein. Either party may terminate these T&C upon written notice (a) if the other party becomes insolvent or ceases paying debts, becomes subject to any proceedings under any bankruptcy or insolvency law, or suffers any similar action in consequence of debt, or (b) if the other party materially breaches these T&C and fails to correct the material breach within thirty (30) days following written notice specifying the material breach and demanding its cure.\nMISCELLANEOUS\nThese T&C, together with the Purchase Order and/or any SOW, constitute the full and entire understanding and agreement between TeraSky and Customer and replaces any previous agreement and/or communications between the parties;\nThese T&C shall not be amended, modified or varied by any oral agreement or representation or otherwise then by written instrument executed by both parties or their duly authorized representatives;\nNo failure, delay or forbearance of either party in exercising any power or right hereunder shall in any way restrict or diminish such party’s rights and powers under these T&C or operate as a waiver of any breach or non-performance by either party of any of the terms or conditions hereof;\nAll notices shall be in writing addressed as set forth on the Purchase Order or as otherwise specified by a party in writing, and shall be deemed validly given or served (a) upon personal delivery, (b) confirmed email delivery to the other party,\nThe laws of the State of Israel shall apply to these T&C and the sole exclusive place of jurisdiction in any matter arising out of or connected with these T&C, Purchase Order or/any Sow shall be the competent courts in Tel Aviv-Yafo.\nName of Customer\nBy:\nTitle:\nDate:"
  },
  {
    "template_name": "SOW Template v5.docx",
    "content": "< Project Name >\nStatement of Work\nVersion 1.0\ndd/mm/yyyy\nThe document is created by:\nName:\nTitle:\nEmail:\nPhone:\nTable of Contents\nAbout TeraSky Group\nTeraSky cuts through complexity to create masterful solutions for companies on their digital transformation journey.\nWhether you are a traditional business in need of digital transformation, or a born-to-the-cloud startup facing the challenges of expansion and scale, our elite team of forward thinkers and competent doers is your solution integration partner.\nYour Goals are our Expertise\nBeat the complexity of new technologies\nWe absorb the increasing complexity of new technologies, knowledge, and methodologies to help companies integrate solutions with simplicity and ease.\nMeet technical, operational, and financial targets\nWhether it’s lowering TCO, increasing availability, or improving compliance, we always see our customers’ goals as our own.\nAchieve successful and safe transformations\nTo ensure success, we drive smooth, safe, and cost-effective digital transformations all the way through, past deployment and onboarding to close.\nWhat We Do: We future-proof digital infrastructures through three primary areas of expertise:\nCloudStructures: Creating easily manageable infrastructures that seamlessly span clouds of any kind and data centers of any size.\nManaged Services\nPublic, private, multi & hybrid clouds\nCloud migration & optimization\nPaaS & cloud automation\nDaaS, Digital Workspaces and more\nManaged services\nAppSpheres: Building platforms for software creation, leveraging the new ways enterprise applications are produced, distributed, and consumed.\nKubernetes and container platforms\nMicroservices\nApp migration and PaaS\nManaged Services\nNewOps: Delivering frameworks, practices, and tools that help IT teams work more efficiently and effectively, without compromising security or data integrity.\nDevOps\nSecOps & DevSecOps\nMonitoring & optimization\nStorage, data protection & security\nManaged Services\nOur Values Drive Your Value\nThe quality of our work is driven by the quality of our people and the values we share. Having worked together for years, our team has cultivated unmatched expertise (what we know and keep on learning), supreme mastery (how we do things), and an uncompromising dedication to our customers.\nSolution Overview\nExecutive Summary\nThe executive summary includes the following: a high-level overview of the project; business and technical drivers for doing the project; and brief description of the customer's business and technical objectives.\nIn addition, we briefly summarize TeraSky professional services to be delivered to meet the customer’s objectives.\nCurrent customer status or challenges\nIn this part we will describe what is the status on the customer side – system in use, challenges, what is not working well, what we want to improve or allow the customer to achieve.\nProposed Solution\nDescribe our proposed solution from a technical architecture perspective.\nA description of the proposed high-level technical architecture should be included in the Statement of Work. It should address common architectural aspects such as: network infrastructure; data/process flows; software services/components; integration/messaging/middleware; security; deployment models; operations/support models. (As appropriate, based on the type of project).\nArchitectural diagram(s) that illustrate the proposed solution architecture should also be included in the Statement of Work. We usually do our best to use the most up-to-date Vendor/ Solution Icons to create architecture diagrams.\nThe document also includes tools being used/proposed to accomplish project deliverables.\nProposed Solution Diagram\nAdd a diagram to illustrate the architecture, flow or any other component that will convey the message.\nProject Overview\nScope of Work and expected deliverables\nIn the document we overview our approach, phases, tasks, etc. regarding how the project should be completed. We provide a list of items and activities as scope of the work expected to be accomplished. See below the example of the task list we use:\nKnowledge Transfer Definition\nKnowledge transfer is not product training.\nIf required, TeraSky can provide training for the involved products that will be included as a dedicated item of the SOW\nKnowledge transfer is focused on covering the deployed solutions and specifics of the current deployment\nKnowledge requirements: Familiarity with the product (engineer specify more details)\nAssumed that knowledge transfer is performed in a single session of up to one day\nOut of Scope\nAll discussed and considered out-of-scope items for the specific project should be documented and agreed upon before the engagement begins.\nProject Success Criteria (only for POC)\nWe provide a bulleted list of essential items for the project's success. The project's critical business and technical objectives are described quantitatively and measurably to be defined and measured for the project’s success.\nAssumptions\nWe create a clear list with all available and known prerequisites, dependencies, constraints, or assumptions for project execution.  We must ensure that any significant external dependencies the project must rely upon for success, such as specific technologies, third-party vendors, development resources, or other business relationships, are considered. Any business or technical constraints that exist which might impact on the project’s completion are taken into consideration.\nChange Request/ Management (Project CR)\nWe have implemented a robust Change Management process in the Statement of Work (SOW) to ensure a smooth and successful project experience. Customers can submit proposed changes through our formal change request mechanism, which TeraSky’s project manager and the solution architect will thoroughly evaluate. We prioritize transparency and communication throughout the change evaluation, implementation, and documentation phases, keeping customers informed of any impact on resources, budget, and timelines.\nWe aim to maintain an adaptable project plan that aligns with your evolving needs, seamlessly integrating approved changes. Continuous monitoring and learning from implemented changes further enhance our project management process, ensuring exceptional project outcomes.\nAcceptance Criteria (ATP/UAT)\nBefore beginning the project execution, both TeraSky and the Customer define the acceptance process and criteria. The customer must review, evaluate, and test the applicable deliverables and “acceptance period” to determine whether each deliverable satisfies the acceptance criteria for deliverables in all material respects, etc.\nIf the deliverable satisfies its acceptance criteria in all material respects, the customer should provide a written acceptance confirmation to TeraSky via the Acceptance Form prior to the end of the Acceptance Period.\nPricing\nThe project will be charged based on the agreed deliverables milestones according to the following structure:\n***INTERNAL NOTE - PAY ATTENTION ***\nWhen setting the milestones, remember to set a process where we can charge every month and adjust the significant deliverable timeframe to allow MONTHLY CHARGE.\nPricing assumptions and conditions:\nBusiness working hours:\nSunday through Thursday, 10:00 – 18:00\nOut-of-business hours definition and rates:\nSunday – Thursday 18:00 – 08:00 – 150%\nWeekend (Friday – Saturday) – 150%\nPublic holidays – 200%\nThe estimate of the project pricing and completion time assumes we will work full days – not less than 8 hours.\nPayment will be per milestone completion.\nAny additional requirements on the above-mentioned will add additional costs.\nThe prices are in USD and do not include VAT.\nThe offer is valid for 30 days (The offer is valid until June 30th, 2023).\nTerms of payment- EOM+ 30 days\nThe payment is in ILS according to the USD / ILS rate of exchange at the date of issuing the invoice.\nFor T&M-based work:\nThe charge will be made at the end of each month according to the usage report.\nOption A: The payment for the days' bank will be charged monthly.\nOption B: The payment for the days' bank will be charged upfront.\nMinimum charging terms:\nOn-site arrival – 0.5 day\nRemote – 1 hour\nService Terms and Conditions\nThe following Terms and Conditions (“T&C”) shall apply, govern and be incorporated into any and all Offers, Purchase Order and/or Statements of Work (“SOW”) to which they are referenced, and shall supersede any and all other terms included in such documents.\nACCEPTANCE\nUpon execution of any Purchase Order and/or SOW Customer and TeraSky adopt and accept these T&C.\nSERVICES AND DELIVERABLES\nTeraSky shall perform the services and provide the deliverables (individually and collectively, the “Deliverables”) according to the specifications agreed by the parties and listed in the relevant Purchase Order and/or SOW.\nTERASKY WARRANTIES\nSubject to the terms of these T&C, TeraSky represents and warrants that the Deliverables shall (a) comply materially with the specifications and requirements set forth in the SOW for a period of one-hundred eighty (180) days from date of delivery; (b) be of high industry standard quality and be performed in a timely and professional manner; (c) be free from faulty design, workmanship and material; and (d) be performed in accordance with all applicable laws.\nDISCLAIMER OF WARRANTIES\nExcept as expressly stated above TeraSky provides the Deliverables on a best efforts basis and all other warranties are specifically excluded, including but not limited to implied warranty of merchantability, fitness for a particular purpose or no infringement.\nCUSTOMER DATA\nTeraSky is not responsible or liable for the deletion of or failure to store any Customer data and other communications maintained or transmitted through use of the Deliverables, Customer is solely responsible for securing and backing up its application, project and Customer Data, TeraSky does not warrant that the operation of the Deliverables will be error free or uninterrupted.\nLIMITATION OF LIABILITY\nTeraSky will not be liable to the Customer or any third party for special, indirect or consequential damages incurred or suffered by the Customer or any third party, arising as a result of or related to the performance of the Deliverables, whether in contract, tort or otherwise. In no event will TeraSky`s aggregate cumulative liability for any claims arising out of or relation to the Deliverables exceed the total fees actually paid to TeraSky by Customer for the Deliverables in respect for the semi-annual period (six (6) months) prior to the date the claim arises.\nINDEMNIFICATION\nEach party shall indemnify and hold harmless the other party and its subsidiary companies and its respective employees, officers, directors, authorized representatives and stockholders from all claims, costs, liabilities, judgments, expenses, damages or losses resulting from any injury to property or persons due to any act, omission or negligence of such party , its agents, employees or contractors or arising out of its performance of the Purchase Order and/or these T&C or arising out of any breach or alleged breach of the Purchase Order and/or these T&C or any representation or warranty made by such party, its agents, employees or contractors.\nCONFIDENTIALITY\nEach party shall hold the Confidential Information of the other in confidence and protect the same with at least the same degree of care, but no less than reasonable care, with which it protects its own most sensitive confidential information. Each party shall use the Confidential Information of the other solely in connection with the exercise of its rights and the performance of its obligations under the Purchase Order and/or any SOW, and shall restrict disclosure of and access to the Confidential Information of the other to such party's personnel, agents and contractors that require access to such Confidential Information in connection with the Purchase Order. Each party shall require its personnel, agents and contractors to comply with the obligations of confidentiality set forth herein and shall be liable for any failure to so comply.\nTERM AND TERMINATION\nThe term shall be as set forth in the Purchase Order and/or any SOW, unless earlier terminated in as set forth herein. Either party may terminate these T&C upon written notice (a) if the other party becomes insolvent or ceases paying debts, becomes subject to any proceedings under any bankruptcy or insolvency law, or suffers any similar action in consequence of debt, or (b) if the other party materially breaches these T&C and fails to correct the material breach within thirty (30) days following written notice specifying the material breach and demanding its cure.\nMISCELLANEOUS\nThese T&C, together with the Purchase Order and/or any SOW, constitute the full and entire understanding and agreement between TeraSky and Customer and replaces any previous agreement and/or communications between the parties;\nThese T&C shall not be amended, modified or varied by any oral agreement or representation or otherwise then by written instrument executed by both parties or their duly authorized representatives;\nNo failure, delay or forbearance of either party in exercising any power or right hereunder shall in any way restrict or diminish such party’s rights and powers under these T&C or operate as a waiver of any breach or non-performance by either party of any of the terms or conditions hereof;\nAll notices shall be in writing addressed as set forth on the Purchase Order or as otherwise specified by a party in writing, and shall be deemed validly given or served (a) upon personal delivery, (b) confirmed email delivery to the other party,\nThe laws of the State of Israel shall apply to these T&C and the sole exclusive place of jurisdiction in any matter arising out of or connected with these T&C, Purchase Order or/any Sow shall be the competent courts in Tel Aviv-Yafo.\nName of Customer\nBy:\nTitle:\nDate:"
  },
  {
    "template_name": "SOW Template v6.docx",
    "content": "< Project Name >\nStatement of Work\nVersion 1.0\ndd/mm/yyyy\nThe document is created by:\nName:\nTitle:\nEmail:\nPhone:\nTable of Contents\nAbout TeraSky Group\nTeraSky cuts through complexity to create masterful solutions for companies on their digital transformation journey.\nWhether you are a traditional business in need of digital transformation, or a born-to-the-cloud startup facing the challenges of expansion and scale, our elite team of forward thinkers and competent doers is your solution integration partner.\nYour Goals are our Expertise\nBeat the complexity of new technologies\nWe absorb the increasing complexity of new technologies, knowledge, and methodologies to help companies integrate solutions with simplicity and ease.\nMeet technical, operational, and financial targets\nWhether it’s lowering TCO, increasing availability, or improving compliance, we always see our customers’ goals as our own.\nAchieve successful and safe transformations\nTo ensure success, we drive smooth, safe, and cost-effective digital transformations all the way through, past deployment and onboarding to close.\nWhat We Do: We future-proof digital infrastructures through three primary areas of expertise:\nCloudStructures: Creating easily manageable infrastructures that seamlessly span clouds of any kind and data centers of any size.\nManaged Services\nPublic, private, multi & hybrid clouds\nCloud migration & optimization\nPaaS & cloud automation\nDaaS, Digital Workspaces and more\nManaged services\nAppSpheres: Building platforms for software creation, leveraging the new ways enterprise applications are produced, distributed, and consumed.\nKubernetes and container platforms\nMicroservices\nApp migration and PaaS\nManaged Services\nNewOps: Delivering frameworks, practices, and tools that help IT teams work more efficiently and effectively, without compromising security or data integrity.\nDevOps\nSecOps & DevSecOps\nMonitoring & optimization\nStorage, data protection & security\nManaged Services\nOur Values Drive Your Value\nThe quality of our work is driven by the quality of our people and the values we share. Having worked together for years, our team has cultivated unmatched expertise (what we know and keep on learning), supreme mastery (how we do things), and an uncompromising dedication to our customers.\nSolution Overview\nExecutive Summary\nThe executive summary includes the following: a high-level overview of the project; business and technical drivers for doing the project; and brief description of the customer's business and technical objectives.\nIn addition, we briefly summarize TeraSky professional services to be delivered to meet the customer’s objectives.\nCurrent customer status or challenges\nIn this part we will describe what is the status on the customer side – system in use, challenges, what is not working well, what we want to improve or allow the customer to achieve.\nProposed Solution\nDescribe our proposed solution from a technical architecture perspective.\nA description of the proposed high-level technical architecture should be included in the Statement of Work. It should address common architectural aspects such as: network infrastructure; data/process flows; software services/components; integration/messaging/middleware; security; deployment models; operations/support models. (As appropriate, based on the type of project).\nArchitectural diagram(s) that illustrate the proposed solution architecture should also be included in the Statement of Work. We usually do our best to use the most up-to-date Vendor/ Solution Icons to create architecture diagrams.\nThe document also includes tools being used/proposed to accomplish project deliverables.\nProposed Solution Diagram\nAdd a diagram to illustrate the architecture, flow or any other component that will convey the message.\nProject Overview\nScope of Work and expected deliverables\nIn the document we overview our approach, phases, tasks, etc. regarding how the project should be completed. We provide a list of items and activities as scope of the work expected to be accomplished. See below the example of the task list we use:\nKnowledge Transfer Definition\nKnowledge transfer is not product training.\nIf required, TeraSky can provide training for the involved products that will be included as a dedicated item of the SOW\nKnowledge transfer is focused on covering the deployed solutions and specifics of the current deployment\nKnowledge requirements: Familiarity with the product (engineer specify more details)\nAssumed that knowledge transfer is performed in a single session of up to one day\nOut of Scope\nAll discussed and considered out-of-scope items for the specific project should be documented and agreed upon before the engagement begins.\nProject Success Criteria (only for POC)\nWe provide a bulleted list of essential items for the project's success. The project's critical business and technical objectives are described quantitatively and measurably to be defined and measured for the project’s success.\nAssumptions\nWe create a clear list with all available and known prerequisites, dependencies, constraints, or assumptions for project execution.  We must ensure that any significant external dependencies the project must rely upon for success, such as specific technologies, third-party vendors, development resources, or other business relationships, are considered. Any business or technical constraints that exist which might impact on the project’s completion are taken into consideration.\nChange Request/ Management (Project CR)\nWe have implemented a robust Change Management process in the Statement of Work (SOW) to ensure a smooth and successful project experience. Customers can submit proposed changes through our formal change request mechanism, which TeraSky’s project manager and the solution architect will thoroughly evaluate. We prioritize transparency and communication throughout the change evaluation, implementation, and documentation phases, keeping customers informed of any impact on resources, budget, and timelines.\nWe aim to maintain an adaptable project plan that aligns with your evolving needs, seamlessly integrating approved changes. Continuous monitoring and learning from implemented changes further enhance our project management process, ensuring exceptional project outcomes.\nAcceptance Criteria (ATP/UAT)\nBefore beginning the project execution, both TeraSky and the Customer define the acceptance process and criteria. The customer must review, evaluate, and test the applicable deliverables and “acceptance period” to determine whether each deliverable satisfies the acceptance criteria for deliverables in all material respects, etc.\nIf the deliverable satisfies its acceptance criteria in all material respects, the customer should provide a written acceptance confirmation to TeraSky via the Acceptance Form prior to the end of the Acceptance Period.\nPricing\nThe project will be charged based on the agreed deliverables milestones according to the following structure:\n***INTERNAL NOTE - PAY ATTENTION ***\nWhen setting the milestones, remember to set a process where we can charge every month and adjust the significant deliverable timeframe to allow MONTHLY CHARGE.\nPricing assumptions and conditions:\nBusiness working hours:\nSunday through Thursday, 10:00 – 18:00\nOut-of-business hours definition and rates:\nSunday – Thursday 18:00 – 08:00 – 150%\nWeekend (Friday – Saturday) – 150%\nPublic holidays – 200%\nThe estimate of the project pricing and completion time assumes we will work full days – not less than 8 hours.\nPayment will be per milestone completion.\nAny additional requirements on the above-mentioned will add additional costs.\nThe prices are in USD and do not include VAT.\nThe offer is valid for 30 days (The offer is valid until June 30th, 2023).\nTerms of payment- EOM+ 30 days\nThe payment is in ILS according to the USD / ILS rate of exchange at the date of issuing the invoice.\nFor T&M-based work:\nThe charge will be made at the end of each month according to the usage report.\nOption A: The payment for the days' bank will be charged monthly.\nOption B: The payment for the days' bank will be charged upfront.\nMinimum charge intervals:\nUp to 4 hours - charge of 0.5 day\nMore than 4 hours - charge of 1 full working day\nService Terms and Conditions\nThe following Terms and Conditions (“T&C”) shall apply, govern and be incorporated into any and all Offers, Purchase Order and/or Statements of Work (“SOW”) to which they are referenced, and shall supersede any and all other terms included in such documents.\nACCEPTANCE\nUpon execution of any Purchase Order and/or SOW Customer and TeraSky adopt and accept these T&C.\nSERVICES AND DELIVERABLES\nTeraSky shall perform the services and provide the deliverables (individually and collectively, the “Deliverables”) according to the specifications agreed by the parties and listed in the relevant Purchase Order and/or SOW.\nTERASKY WARRANTIES\nSubject to the terms of these T&C, TeraSky represents and warrants that the Deliverables shall (a) comply materially with the specifications and requirements set forth in the SOW for a period of one-hundred eighty (180) days from date of delivery; (b) be of high industry standard quality and be performed in a timely and professional manner; (c) be free from faulty design, workmanship and material; and (d) be performed in accordance with all applicable laws.\nDISCLAIMER OF WARRANTIES\nExcept as expressly stated above TeraSky provides the Deliverables on a best efforts basis and all other warranties are specifically excluded, including but not limited to implied warranty of merchantability, fitness for a particular purpose or no infringement.\nCUSTOMER DATA\nTeraSky is not responsible or liable for the deletion of or failure to store any Customer data and other communications maintained or transmitted through use of the Deliverables, Customer is solely responsible for securing and backing up its application, project and Customer Data, TeraSky does not warrant that the operation of the Deliverables will be error free or uninterrupted.\nLIMITATION OF LIABILITY\nTeraSky will not be liable to the Customer or any third party for special, indirect or consequential damages incurred or suffered by the Customer or any third party, arising as a result of or related to the performance of the Deliverables, whether in contract, tort or otherwise. In no event will TeraSky`s aggregate cumulative liability for any claims arising out of or relation to the Deliverables exceed the total fees actually paid to TeraSky by Customer for the Deliverables in respect for the semi-annual period (six (6) months) prior to the date the claim arises.\nINDEMNIFICATION\nEach party shall indemnify and hold harmless the other party and its subsidiary companies and its respective employees, officers, directors, authorized representatives and stockholders from all claims, costs, liabilities, judgments, expenses, damages or losses resulting from any injury to property or persons due to any act, omission or negligence of such party , its agents, employees or contractors or arising out of its performance of the Purchase Order and/or these T&C or arising out of any breach or alleged breach of the Purchase Order and/or these T&C or any representation or warranty made by such party, its agents, employees or contractors.\nCONFIDENTIALITY\nEach party shall hold the Confidential Information of the other in confidence and protect the same with at least the same degree of care, but no less than reasonable care, with which it protects its own most sensitive confidential information. Each party shall use the Confidential Information of the other solely in connection with the exercise of its rights and the performance of its obligations under the Purchase Order and/or any SOW, and shall restrict disclosure of and access to the Confidential Information of the other to such party's personnel, agents and contractors that require access to such Confidential Information in connection with the Purchase Order. Each party shall require its personnel, agents and contractors to comply with the obligations of confidentiality set forth herein and shall be liable for any failure to so comply.\nTERM AND TERMINATION\nThe term shall be as set forth in the Purchase Order and/or any SOW, unless earlier terminated in as set forth herein. Either party may terminate these T&C upon written notice (a) if the other party becomes insolvent or ceases paying debts, becomes subject to any proceedings under any bankruptcy or insolvency law, or suffers any similar action in consequence of debt, or (b) if the other party materially breaches these T&C and fails to correct the material breach within thirty (30) days following written notice specifying the material breach and demanding its cure.\nMISCELLANEOUS\nThese T&C, together with the Purchase Order and/or any SOW, constitute the full and entire understanding and agreement between TeraSky and Customer and replaces any previous agreement and/or communications between the parties;\nThese T&C shall not be amended, modified or varied by any oral agreement or representation or otherwise then by written instrument executed by both parties or their duly authorized representatives;\nNo failure, delay or forbearance of either party in exercising any power or right hereunder shall in any way restrict or diminish such party’s rights and powers under these T&C or operate as a waiver of any breach or non-performance by either party of any of the terms or conditions hereof;\nAll notices shall be in writing addressed as set forth on the Purchase Order or as otherwise specified by a party in writing, and shall be deemed validly given or served (a) upon personal delivery, (b) confirmed email delivery to the other party,\nThe laws of the State of Israel shall apply to these T&C and the sole exclusive place of jurisdiction in any matter arising out of or connected with these T&C, Purchase Order or/any Sow shall be the competent courts in Tel Aviv-Yafo.\nName of Customer\nBy:\nTitle:\nDate:"
  }
]